In [19]:
import pandas as pd
import seaborn as sns

In [20]:
titanic = sns.load_dataset('titanic')

In [30]:
df=titanic.loc[:,['age','fare']]
df

      age     fare
0    22.0   7.2500
1    38.0  71.2833
2    26.0   7.9250
3    35.0  53.1000
4    35.0   8.0500
..    ...      ...
886  27.0  13.0000
887  19.0  30.0000
888   NaN  23.4500
889  26.0  30.0000
890  32.0   7.7500

[891 rows x 2 columns]

In [6]:
df['ten'] =10
print(df.head())

    age     fare  ten
0  22.0   7.2500   10
1  38.0  71.2833   10
2  26.0   7.9250   10
3  35.0  53.1000   10
4  35.0   8.0500   10

In [22]:
def add_10(n):
    return n+10
def add_two_obj(a,b):
    return a+b
print(add_10(10))
print(add_two_obj(10,10))

20
20

In [39]:
sr1=df['age'].apply(add_10)
print(sr1.head())
print()
sr2=df['age'].apply(add_two_obj, b=10)
print(sr2.head())
print()
sr3=df['age'].apply(lambda x: add_10(x))
print(sr3)

0    32.0
1    48.0
2    36.0
3    45.0
4    45.0
Name: age, dtype: float64

0    32.0
1    48.0
2    36.0
3    45.0
4    45.0
Name: age, dtype: float64

0      32.0
1      48.0
2      36.0
3      45.0
4      45.0
       ...
886    37.0
887    29.0
888     NaN
889    36.0
890    42.0
Name: age, Length: 891, dtype: float64

In [23]:
df_map = df.applymap(add_10)
print(df.head())
print()
print(df_map.head())

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

    age     fare
0  32.0  17.2500
1  48.0  81.2833
2  36.0  17.9250
3  45.0  63.1000
4  45.0  18.0500

In [24]:
def missing_value(series):
    return series.isnull()

result=df.apply(missing_value, axis=0)
print(result.head())
print()
print(type(result))

     age   fare
0  False  False
1  False  False
2  False  False
3  False  False
4  False  False

<class 'pandas.core.frame.DataFrame'>

In [41]:
def min_max(x):
    return x.max() - x.min()

result=df.apply(min_max)
print(result)
print()
print(type(result))

age      79.5800
fare    512.3292
dtype: float64

<class 'pandas.core.series.Series'>

In [47]:
df['ten'] =10

def add_two_obj(a,b):
    return a+b

df['add'] = df.apply(lambda x: add_two_obj(x['age'],x['ten']),axis=1)
print(df.head())
df['add'] = df.pipe(lambda x: add_two_obj(x['age'],x['ten']))
print(df.head())

    age     fare  ten   add
0  22.0   7.2500   10  32.0
1  38.0  71.2833   10  48.0
2  26.0   7.9250   10  36.0
3  35.0  53.1000   10  45.0
4  35.0   8.0500   10  45.0
    age     fare  ten   add
0  22.0   7.2500   10  32.0
1  38.0  71.2833   10  48.0
2  26.0   7.9250   10  36.0
3  35.0  53.1000   10  45.0
4  35.0   8.0500   10  45.0

In [32]:
df=titanic.loc[:,['age','fare']]
def missing_value(x):
    return x.isnull()

def missing_count(x):
    return missing_value(x).sum()

def total_number_missing(x):
    return missing_count(x).sum()

In [33]:
result_df = df.pipe(missing_value)
print(result_df.head())
print(type(result_df))

     age   fare
0  False  False
1  False  False
2  False  False
3  False  False
4  False  False
<class 'pandas.core.frame.DataFrame'>

In [34]:
result_series=df.pipe(missing_count)
print(result_series)
print(type(result_series))

age     177
fare      0
dtype: int64
<class 'pandas.core.series.Series'>

In [35]:
result_value =df.pipe(total_number_missing)
print(result_value)
print(type(result_value))

177
<class 'numpy.int64'>

In [59]:
df=titanic.loc[0:4, 'survived':'age']
columns= list(df.columns.values)
columns_sorted = sorted(columns)
df_sorted=df[columns_sorted]
print(df_sorted,'\n')

    age  pclass     sex
0  22.0       3    male
1  38.0       1  female
2  26.0       3  female
3  35.0       1  female

In [53]:
columns_reversed=list(reversed(columns))
df_reversed= df[columns_reversed]
print(df_reversed,'\n')

    age     sex  pclass  survived
0  22.0    male       3         0
1  38.0  female       1         1
2  26.0  female       3         1
3  35.0  female       1         1
4  35.0    male       3         0

In [54]:
columns_customed =['pclass','sex','age','survived']
df_customed=df[columns_customed]
print(df_customed)

   pclass     sex   age  survived
0       3    male  22.0         0
1       1  female  38.0         1
2       3  female  26.0         1
3       1  female  35.0         1
4       3    male  35.0         0

In [57]:
df_sample = pd.DataFrame({'A': [1, 2, 3, 4, 5], 'B': [6, 7, 8, 9, 10]})

def cal1(x):
    return x+2
def cal2(x):
    return x*3
result_sample=df_sample.pipe(cal1).pipe(cal2)
print(df_sample)
print()
print(result_sample)

   A   B
0  1   6
1  2   7
2  3   8
3  4   9
4  5  10

    A   B
0   9  24
1  12  27
2  15  30
3  18  33
4  21  36